# FilterStringRule Constructor (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
FilterStringRule Constructor
FilterStringRule Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringRule(FilterableValueProvider, FilterStringRuleEvaluator, String) | Constructs an instance of FilterStringRule. |
| FilterStringRule(FilterableValueProvider, FilterStringRuleEvaluator, String, Boolean) | **Obsolete.** Constructs an instance of FilterStringRule. |

# See Also
FilterStringRule Class
FilterStringRule Members
Autodesk.Revit.DB Namespace